# 1) Создать переменную типа String

item_1 = 'Aleksey'
print(type(item_1))

# 2) Создать переменную типа Integer

item_2 = 30
print(type(item_2))

# 3) Создать переменную типа Float

item_3 = 3.88
print(type(item_3))

# 4) Создать переменную типа Bytes

item_4 = b"Hello"
print(type(item_4))

5) Создать переменную типа List

item_5 = ["cola", "fanta", "sprite"]
print(type(item_5))

6) Создать переменную типа Tuple
7) Создать переменную типа Set
8. Создать переменную типа Frozen set
9) Создать переменную типа Dict

10) Вывести в консоль все выше перечисленные переменные с добавлением типа данных.

11) Создать 2 переменные String, создать переменную в которой сканкатенируете эти переменные. Вывести в консоль.
12) Вывести в одну строку переменные типа String и Integer используя “,” (Запятую)
13) Вывести в одну строку переменные типа String и Integer используя “+” (Плюс)
